# PANDAS

Each row and column in a pandas dataframe is a series (1-d data-structure). 
Dataframe is a 2-dimensional data-structure.

In [28]:
import pandas as pd

In [29]:
type(pd)

module

In [30]:
name = ["A","B", "C", "D", "E"]
age = [20, 30, 40, 50, 60]
DataScience = [80, 90, 98, 90, 87]

In [31]:
students = pd.DataFrame(data = {"Name": name, "Age": age, "DataScienceMarks": DataScience})

In [32]:
students

  Name  Age  DataScienceMarks
0    A   20                80
1    B   30                90
2    C   40                98
3    D   50                90
4    E   60                87

In [33]:
students.columns

Index(['Name', 'Age', 'DataScienceMarks'], dtype='object')

In [34]:
students.columns[0] = "Names"

TypeError: Index does not support mutable operations

In [ ]:
l = list(students.columns)
l

In [ ]:
l[0] = "Names"

In [ ]:
students.columns = l

In [ ]:
students

In [ ]:
students.index

In [ ]:
students.index = ["A", "B", "C", "D", "E"]

In [ ]:
students

In [ ]:
students.index[2] = "P"

In [ ]:
l = list(students.index)
l[2] = "P"
students.index = l

In [ ]:
students

In [ ]:
students.set_index("Names")

In [35]:
students

  Name  Age  DataScienceMarks
0    A   20                80
1    B   30                90
2    C   40                98
3    D   50                90
4    E   60                87

In [37]:
students=students.set_index("Name")

In [38]:
students

      Age  DataScienceMarks
Name
A      20                80
B      30                90
C      40                98
D      50                90
E      60                87

In [39]:
students.reset_index() #converting the index to a column

  Name  Age  DataScienceMarks
0    A   20                80
1    B   30                90
2    C   40                98
3    D   50                90
4    E   60                87

In [40]:
students

      Age  DataScienceMarks
Name
A      20                80
B      30                90
C      40                98
D      50                90
E      60                87

In [41]:
students = students.reset_index() #converting the index to a column

In [42]:
students

  Name  Age  DataScienceMarks
0    A   20                80
1    B   30                90
2    C   40                98
3    D   50                90
4    E   60                87

In [44]:
students.set_index("Name", inplace = True)  # this will reflect the changes inplace in the students dataframe and return a null value

In [45]:
students

      Age  DataScienceMarks
Name
A      20                80
B      30                90
C      40                98
D      50                90
E      60                87

In [47]:
s = students.reset_index(inplace = True) #here changes will be reflected inplace and s will have a null value

In [48]:
students

  Name  Age  DataScienceMarks
0    A   20                80
1    B   30                90
2    C   40                98
3    D   50                90
4    E   60                87

In [49]:
s

----

In [53]:
pwd()

'/home/labsuser/June06_batch'

In [51]:
#when the file is there in the working directory
titanic_train = pd.read_csv("titanic_train.csv")

In [52]:
titanic_train[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S